app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "Can you edit the article? A: No, not yet. edit: yes we can"], ["updated_at", "2019-03-04 04:08:48.376562"], ["id", 4]]